cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "neovim/neovim"

brew "stow"
brew "asdf"
brew "fd"
brew "fish"
brew "font-jetbrains-mono"
brew "neovim"
brew "exa"
brew "fzf"
brew "hub"
brew "ripgrep"

cask "amethyst"
cask "https://raw.githubusercontent.com/Homebrew/homebrew-cask/5b112c6a968113fb37d147f854451fb0988bd4db/Casks/arq.rb"
cask "dropbox"
cask "fsnotes"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "macpass"
cask "mailmate"
cask "mylio"
cask "skype"
cask "typora"
cask "visual-studio-code"
cask "wire"

mas 'Amphetamine', id: 937984704

