cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "neovim/neovim"
tap "koekeishiya/formulae"

brew "cask"

brew "perl"
brew "cpanminus"
brew "automake"
brew "wget"
brew "curl"
brew "gpg"
brew "mas"
brew "exa"
brew "fd"
brew "fish"
brew "hub"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "neovim"
brew "ripgrep"

cask "keepassxc"
cask "macpass"
cask "insync"
cask "fsnotes"
cask "hiddenbar"
cask "iterm2"
cask "mailmate"
cask "mylio"
cask "typora"
cask "wire"
cask "gpg-suite-no-mail"
